InformationRegisters/ПравилаЗаполненияПолейЭСЧФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПравилаЗаполненияПолейЭСЧФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доступный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПравилаЗаполненияПолейЭСЧФ/Ext/ManagerModule.bsl
Процедура ЗагрузитьПравилаИзМакета() Экспорт
	
	Шаблон = РегистрыСведений.ПравилаЗаполненияПолейЭСЧФ.ПолучитьМакет("ПравилаЗаполненияПолей");
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных 	= Новый ОписаниеИсточникаДанных(Шаблон.Область("ПравилаПреобразования"));
	ПЗ.Выполнить();
	ВсеПравила = ПЗ.Результат.Выгрузить();
	
	ПорядковыйНомер = 1;
	НаборЗаписей = РегистрыСведений.ПравилаЗаполненияПолейЭСЧФ.СоздатьНаборЗаписей();
	Для Каждого СтрокаПравила Из ВсеПравила Цикл
		
		НовоеПравило = НаборЗаписей.Добавить();
		НовоеПравило.ПорядковыйНомер  	= ПорядковыйНомер; 
		НовоеПравило.Наименование  		= СтрокаПравила.Наименование; 
		НовоеПравило.Правило 			= СтрокаПравила.Правило;
		НовоеПравило.ИмяРеквизита 		= СтрокаПравила.ИмяРеквизита;
		НовоеПравило.Доступный 			= СтрокаПравила.Доступный;
		НовоеПравило.Обязательный 		= СтрокаПравила.Обязательный;
		НовоеПравило.ПроверкаЗаполнения = СтрокаПравила.ПроверкаЗаполнения;
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
